renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_hlibusbip.c
        case USB_HHID:
#if defined(USB_CFG_HHID_USE)
            if (USB_EP_INT == type)
            {
                if (USB_PIPE_DIR_IN == dir)
                {
                    switch (address)
                    {
                        case 1: /* Root port device1 */
                        case 2: /* Hub downport device1 */
                            pipe_no     = USB_CFG_HHID_INT_IN;
                        break;
                        case 3:/* Hub downport device2 */
                            pipe_no     = USB_CFG_HHID_INT_IN2;
                        break;
                        case 4:/* Hub downport device3 */
                            pipe_no     = USB_CFG_HHID_INT_IN3;
                        break;
                        default:
                        break;
                    }
                }
                else
                {   /* Check root port device1 or Hub downport device1 */
                    if ((1 == address) || (2 == address))
                    {
                        pipe_no     = USB_CFG_HHID_INT_OUT;
                    }
                }
            }
#endif /* defined(USB_CFG_HHID_USE) */
        break;

        case USB_HMSC:
#if defined(USB_CFG_HMSC_USE)
            if (USB_EP_BULK == type)
            {   /* Add USB IP no. for USB Device address */
                if (USB_IP1 == ip_no)
                {
                    address |= USBA_ADDRESS_OFFSET;
                }

                /* Get Strage drive no. */
                side = usb_hmsc_ref_drvno (address);

                /* Check Strage drive no. */
                if (side < USB_MAXSTRAGE)
                {   /* Calculate the pipe number corresponding to the drive number */
                    pipe_no     = (USB_PIPE1 + side);
                }
            }
#endif /* defined(USB_CFG_HMSC_USE) */
        break;

        case USB_HUB:
            pipe_no     = USB_HUB_PIPE;
        break;

        default:
            return USB_NULL;
        break;
    }

    return pipe_no;
} /* eof usb_hstd_get_pipe_no() */

/******************************************************************************
Function Name   : usb_hstd_get_pipe_peri_value
Description     : Get value to be set in PIPEPERI
Arguments       : uint16_t  speed     : USB speed
                : uint8_t   binterval : bInterval for ENDPOINT Descriptor.
Return value    : Value for set PIPEPERI
******************************************************************************/
uint16_t usb_hstd_get_pipe_peri_value (uint16_t speed, uint8_t binterval)
{
    uint16_t    pipe_peri = USB_NULL;
    uint16_t    work1;
    uint16_t    work2;

    /* set interval counter */
    if (0 != binterval)
    {
        /* FS/LS interrupt */
        if (USB_HSCONNECT != speed)
        {
            /* The time of the FS/LS interrupt forwarding of the interval is specified by the unit of ms. */
            /* It is necessary to calculate to specify USB-IP by the n-th power of two. */
            /* The NAK rate of the control and the bulk transfer doesn't correspond. */
            work1 = binterval;
            work2 = 0;
            for(  ; work1 != 0; work2++ )
            {
                work1 = (uint16_t)(work1 >> 1);
            }
            if (0 != work2)
            {
                /* Interval time */
                pipe_peri |= (uint16_t)(work2 - 1);
            }
        }
        else
        {   /* Hi-Speed */
            if (8 >= binterval)
            {
                /* Interval time */
                pipe_peri = (uint16_t) (binterval - 1u);
            }
            else
            {
                /* Max Interval time */
                pipe_peri = (uint16_t) (USB_IITVFIELD);
            }
        }
    }

    return pipe_peri;
} /* eof usb_hstd_get_pipe_peri_value() */

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

/******************************************************************************
 End  Of File
 ******************************************************************************/
